require Rails.root.join("lib/tasks/tonkotsu_helpers")
require Rails.root.join("lib/tasks/fetch_google_places_helpers")

namespace :fetch_google do
  desc "東京都23区 とんこつ店収集"
  task tokyo: :environment do
    api_key = ENV["PLACES_API_KEY"]

    keywords = ["ラーメン", "豚骨", "とんこつ", "博多ラーメン"]

    areas = {
      "東京駅" => [35.6812, 139.7671],
      "神田" => [35.6917, 139.7708],
      "秋葉原" => [35.6984, 139.7730],
      "日本橋" => [35.6839, 139.7730],
      "銀座" => [35.6717, 139.7650],
      "新橋" => [35.6663, 139.7586],
      "浜松町" => [35.6554, 139.7570],
      "品川" => [35.6285, 139.7387],
      "六本木" => [35.6628, 139.7310],
      "麻布十番" => [35.6560, 139.7360],
      "赤坂" => [35.6720, 139.7370],

      "新宿" => [35.6900, 139.7000],
      "西新宿" => [35.6941, 139.6922],
      "歌舞伎町" => [35.6938, 139.7034],
      "渋谷" => [35.6580, 139.7016],
      "恵比寿" => [35.6467, 139.7100],

      "上野" => [35.7138, 139.7773],
      "浅草" => [35.7101, 139.7966],

      "池袋" => [35.7295, 139.7109],
      "赤羽" => [35.7776, 139.7211],

      "中野" => [35.7056, 139.6657],

      "錦糸町" => [35.6963, 139.8140],
      "門前仲町" => [35.6717, 139.7967],

      "蒲田" => [35.5612, 139.7160],
      "北千住" => [35.7499, 139.8049],
      "小岩" => [35.7335, 139.8823]
    }

    FetchGooglePlacesHelpers.run!(
      api_key: api_key,
      areas: areas,
      keywords: keywords,
      title: "東京23区"
    )
  end
end
